from phrases.phrase_types import PhraseTypes

phrases = {
    PhraseTypes.WELCOME_PHRASE: [
        "Привіт, привіт!\n\nЯ - гуру ФІ і можу відповісти на питання, які тебе цікавлять. Скоріш пиши мені "
        "питання і я одразу ж відповім на нього!\n\nЯкщо хочеш дізнатися більш детально про мене, то тисни /help"
    ],
    PhraseTypes.ASK_QUESTION_PHRASE: [
        "Просто напиши своє питання сюди і я обов'язково на нього відповім!",
        "Ти навіть можеш додати мене в групу, але спочатку задай питяннячко!",
        "Давааай, я знаю, що ти хочеш щось спитати! Я вже зачекався!"
    ],
    PhraseTypes.PLEASE_WAIT_PHRASE: [
        "Гугл обробляє близько 2 млн запитів за секунду і я теж скоро так зможу, "
        "але для всього свій час. Тож почекай, будь ласочка!",
        "Підбираємо інфу та дезінфікуємо руці, щоб зміг написати відповідь "
        "на твоє питання :)",
        "ВООЗ каже мити руки, а мені сказали вчитися відповідати на питання."
    ],
    PhraseTypes.PLEASE_RANK_PHRASE: [
        "Я знаю, що я не ідеальний, але ти можеш зробити мене таким, поставивши оцінку на кожну відповідь. "
        "До речі, якщо вони всі не підійшли, то натисни кнопку нижче і спитаєш у справжнії експертів.",
        "Якщо відповідь була так собі, то можемо разом запитати в чатику експертів. Тисни кнопку знизу. "
        "До речі, не хочеш оцінити мої відповіді, щоб у подальшому вони стали ще більш точними?",
        "Я ціню твої питання, а ти оціниш мої відповіді, щоб я став краще? І якщо жодна з них не задовольнила "
        "твою цікавість можемо спитати в чатику експертів."
    ],
    PhraseTypes.HELP_PHRASE: [
        "Зі мною дуже просто!\n\nДивись, щоб поставити будь-яке запитання просто пиши "
        "його мені і я постараюсь дати на нього відповідь. В свою чергу буде дуже круто, "
        "якщо ти оціниш мої відповіді, таким чином я зможу стати краще!\n\n"
        "Ти можеш використовувати навіть в групі зі своїми друзями. Додай мене "
        "у чатик і коли у вас почнуть виникати запитання до мене, то просто у "
        "повідомленні з текстом запитання тегни мене (@FIChatbot) і я неодмінно "
        "відповім на всі ваші запитання!"
    ],
    PhraseTypes.ASK_QUESTION_IN_GROUP_PHRASE: [
        "Просто напишіть своє питання сюди з тегом @FIChatbot і я обов'язково на нього відповім!",
        "Давааай, я знаю, що ви хочеште щось спитати! Я вже зачекався! Тегайте @FIChatbot та питайте!"
    ]
}
